// ConsoleApplication2.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include "stdafx.h" 
#include <iostream> 


int main()
{
	setlocale(LC_CTYPE, "");
	std::cout << "\\a Звонок (предупреждение)\n";
	std::cout << "\\b Backspace\n";
	std::cout << "\\f Перевод страницы\n";
	std::cout << "\\n Новая строка\n";
	std::cout << "\\r Возврат каретки\n";
	std::cout << "\\t Горизонтальная табуляция\n";
	std::cout << "\\v Вертикальная табуляция\n";
	std::cout << "\\' Одиночная кавычка\n";
	std::cout << "\\\\ Обратная косая черта\n";
	std::cout << "\\? Литерал вопросительного знака\n";
	std::cout << "\\ooo Символ ASCII в восьмеричной нотации\n";
	std::cout << "\\x hh Символ ASCII в шестнадцатеричной нотации\n";
	std::cout << "\\x h hhh Символ юникода в шестнадцатеричном формате, если эта escape-последовательность используется в многобайтовой знаковой константе или строковом литерале юникода.\n";
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
