#include "stdafx.h" 
#include <iostream> 

int main()
{
	setlocale(LC_CTYPE, "");
	std::cout << "\\a Звонок (предупреждение)\n";
	std::cout << "\\b Backspace\n";
	std::cout << "\\f Перевод страницы\n";
	std::cout << "\\n Новая строка\n";
	std::cout << "\\r Возврат каретки\n";
	std::cout << "\\t Горизонтальная табуляция\n";
	std::cout << "\\v Вертикальная табуляция\n";
	std::cout << "\\' Одиночная кавычка\n";
	std::cout << "\\\\ Обратная косая черта\n";
	std::cout << "\\? Литерал вопросительного знака\n";
	std::cout << "\\ooo Символ ASCII в восьмеричной нотации\n";
	std::cout << "\\x hh Символ ASCII в шестнадцатеричной нотации\n";
	std::cout << "\\x h hhh Символ юникода в шестнадцатеричном формате, если эта escape-последовательность используется в многобайтовой знаковой константе или строковом литерале юникода.\n";
}

